import sys
from math import trunc
from typing import (
class GeorgianLocale(Locale):
    names = ['ka', 'ka-ge']
    past = '{0} წინ'
    future = '{0} შემდეგ'
    and_word = 'და'
    timeframes = {'now': 'ახლა', 'second': 'წამის', 'seconds': '{0} წამის', 'minute': 'წუთის', 'minutes': '{0} წუთის', 'hour': 'საათის', 'hours': '{0} საათის', 'day': 'დღის', 'days': '{0} დღის', 'week': 'კვირის', 'weeks': '{0} კვირის', 'month': 'თვის', 'months': '{0} თვის', 'year': 'წლის', 'years': '{0} წლის'}
    month_names = ['', 'იანვარი', 'თებერვალი', 'მარტი', 'აპრილი', 'მაისი', 'ივნისი', 'ივლისი', 'აგვისტო', 'სექტემბერი', 'ოქტომბერი', 'ნოემბერი', 'დეკემბერი']
    month_abbreviations = ['', 'იანვარი', 'თებერვალი', 'მარტი', 'აპრილი', 'მაისი', 'ივნისი', 'ივლისი', 'აგვისტო', 'სექტემბერი', 'ოქტომბერი', 'ნოემბერი', 'დეკემბერი']
    day_names = ['', 'ორშაბათი', 'სამშაბათი', 'ოთხშაბათი', 'ხუთშაბათი', 'პარასკევი', 'შაბათი', 'კვირა']
    day_abbreviations = ['', 'ორშაბათი', 'სამშაბათი', 'ოთხშაბათი', 'ხუთშაბათი', 'პარასკევი', 'შაბათი', 'კვირა']