import sys
from math import trunc
from typing import (
class MalayalamLocale(Locale):
    names = ['ml']
    past = '{0} മുമ്പ്'
    future = '{0} ശേഷം'
    timeframes = {'now': 'ഇപ്പോൾ', 'second': 'ഒരു നിമിഷം', 'seconds': '{0} സെക്കന്റ്\u200c', 'minute': 'ഒരു മിനിറ്റ്', 'minutes': '{0} മിനിറ്റ്', 'hour': 'ഒരു മണിക്കൂർ', 'hours': '{0} മണിക്കൂർ', 'day': 'ഒരു ദിവസം ', 'days': '{0} ദിവസം ', 'month': 'ഒരു മാസം ', 'months': '{0} മാസം ', 'year': 'ഒരു വർഷം ', 'years': '{0} വർഷം '}
    meridians = {'am': 'രാവിലെ', 'pm': 'ഉച്ചക്ക് ശേഷം', 'AM': 'രാവിലെ', 'PM': 'ഉച്ചക്ക് ശേഷം'}
    month_names = ['', 'ജനുവരി', 'ഫെബ്രുവരി', 'മാർച്ച്\u200c', 'ഏപ്രിൽ ', 'മെയ്\u200c ', 'ജൂണ്\u200d', 'ജൂലൈ', 'ഓഗസ്റ്റ്\u200c', 'സെപ്റ്റംബർ', 'ഒക്ടോബർ', 'നവംബർ', 'ഡിസംബർ']
    month_abbreviations = ['', 'ജനു', 'ഫെബ് ', 'മാർ', 'ഏപ്രിൽ', 'മേയ്', 'ജൂണ്\u200d', 'ജൂലൈ', 'ഓഗസ്റ', 'സെപ്റ്റ', 'ഒക്ടോ', 'നവം', 'ഡിസം']
    day_names = ['', 'തിങ്കള്\u200d', 'ചൊവ്വ', 'ബുധന്\u200d', 'വ്യാഴം', 'വെള്ളി', 'ശനി', 'ഞായര്\u200d']
    day_abbreviations = ['', 'തിങ്കള്\u200d', 'ചൊവ്വ', 'ബുധന്\u200d', 'വ്യാഴം', 'വെള്ളി', 'ശനി', 'ഞായര്\u200d']