import sys
from math import trunc
from typing import (
class GreekLocale(Locale):
    names = ['el', 'el-gr']
    past = '{0} πριν'
    future = 'σε {0}'
    and_word = 'και'
    timeframes = {'now': 'τώρα', 'second': 'ένα δεύτερο', 'seconds': '{0} δευτερόλεπτα', 'minute': 'ένα λεπτό', 'minutes': '{0} λεπτά', 'hour': 'μία ώρα', 'hours': '{0} ώρες', 'day': 'μία μέρα', 'days': '{0} μέρες', 'week': 'μία εβδομάδα', 'weeks': '{0} εβδομάδες', 'month': 'ένα μήνα', 'months': '{0} μήνες', 'year': 'ένα χρόνο', 'years': '{0} χρόνια'}
    month_names = ['', 'Ιανουαρίου', 'Φεβρουαρίου', 'Μαρτίου', 'Απριλίου', 'Μαΐου', 'Ιουνίου', 'Ιουλίου', 'Αυγούστου', 'Σεπτεμβρίου', 'Οκτωβρίου', 'Νοεμβρίου', 'Δεκεμβρίου']
    month_abbreviations = ['', 'Ιαν', 'Φεβ', 'Μαρ', 'Απρ', 'Μαϊ', 'Ιον', 'Ιολ', 'Αυγ', 'Σεπ', 'Οκτ', 'Νοε', 'Δεκ']
    day_names = ['', 'Δευτέρα', 'Τρίτη', 'Τετάρτη', 'Πέμπτη', 'Παρασκευή', 'Σάββατο', 'Κυριακή']
    day_abbreviations = ['', 'Δευ', 'Τρι', 'Τετ', 'Πεμ', 'Παρ', 'Σαβ', 'Κυρ']