import sys
from math import trunc
from typing import (
class HindiLocale(Locale):
    names = ['hi', 'hi-in']
    past = '{0} पहले'
    future = '{0} बाद'
    timeframes = {'now': 'अभी', 'second': 'एक पल', 'seconds': '{0} सेकंड्', 'minute': 'एक मिनट ', 'minutes': '{0} मिनट ', 'hour': 'एक घंटा', 'hours': '{0} घंटे', 'day': 'एक दिन', 'days': '{0} दिन', 'month': 'एक माह ', 'months': '{0} महीने ', 'year': 'एक वर्ष ', 'years': '{0} साल '}
    meridians = {'am': 'सुबह', 'pm': 'शाम', 'AM': 'सुबह', 'PM': 'शाम'}
    month_names = ['', 'जनवरी', 'फरवरी', 'मार्च', 'अप्रैल ', 'मई', 'जून', 'जुलाई', 'अगस्त', 'सितंबर', 'अक्टूबर', 'नवंबर', 'दिसंबर']
    month_abbreviations = ['', 'जन', 'फ़र', 'मार्च', 'अप्रै', 'मई', 'जून', 'जुलाई', 'आग', 'सित', 'अकत', 'नवे', 'दिस']
    day_names = ['', 'सोमवार', 'मंगलवार', 'बुधवार', 'गुरुवार', 'शुक्रवार', 'शनिवार', 'रविवार']
    day_abbreviations = ['', 'सोम', 'मंगल', 'बुध', 'गुरुवार', 'शुक्र', 'शनि', 'रवि']