import sys
from math import trunc
from typing import (
class NepaliLocale(Locale):
    names = ['ne', 'ne-np']
    past = '{0} पहिले'
    future = '{0} पछी'
    timeframes = {'now': 'अहिले', 'second': 'एक सेकेन्ड', 'seconds': '{0} सेकण्ड', 'minute': 'मिनेट', 'minutes': '{0} मिनेट', 'hour': 'एक घण्टा', 'hours': '{0} घण्टा', 'day': 'एक दिन', 'days': '{0} दिन', 'month': 'एक महिना', 'months': '{0} महिना', 'year': 'एक बर्ष', 'years': '{0} बर्ष'}
    meridians = {'am': 'पूर्वाह्न', 'pm': 'अपरान्ह', 'AM': 'पूर्वाह्न', 'PM': 'अपरान्ह'}
    month_names = ['', 'जनवरी', 'फेब्रुअरी', 'मार्च', 'एप्रील', 'मे', 'जुन', 'जुलाई', 'अगष्ट', 'सेप्टेम्बर', 'अक्टोबर', 'नोवेम्बर', 'डिसेम्बर']
    month_abbreviations = ['', 'जन', 'फेब', 'मार्च', 'एप्रील', 'मे', 'जुन', 'जुलाई', 'अग', 'सेप', 'अक्ट', 'नोव', 'डिस']
    day_names = ['', 'सोमवार', 'मंगलवार', 'बुधवार', 'बिहिवार', 'शुक्रवार', 'शनिवार', 'आइतवार']
    day_abbreviations = ['', 'सोम', 'मंगल', 'बुध', 'बिहि', 'शुक्र', 'शनि', 'आइत']