import sys
from math import trunc
from typing import (
class UrduLocale(Locale):
    names = ['ur', 'ur-pk']
    past = 'پہلے {0}'
    future = 'میں {0}'
    and_word = 'اور'
    timeframes = {'now': 'ابھی', 'second': 'ایک سیکنڈ', 'seconds': '{0} سیکنڈ', 'minute': 'ایک منٹ', 'minutes': '{0} منٹ', 'hour': 'ایک گھنٹے', 'hours': '{0} گھنٹے', 'day': 'ایک دن', 'days': '{0} دن', 'week': 'ایک ہفتے', 'weeks': '{0} ہفتے', 'month': 'ایک مہینہ', 'months': '{0} ماہ', 'year': 'ایک سال', 'years': '{0} سال'}
    month_names = ['', 'جنوری', 'فروری', 'مارچ', 'اپریل', 'مئی', 'جون', 'جولائی', 'اگست', 'ستمبر', 'اکتوبر', 'نومبر', 'دسمبر']
    month_abbreviations = ['', 'جنوری', 'فروری', 'مارچ', 'اپریل', 'مئی', 'جون', 'جولائی', 'اگست', 'ستمبر', 'اکتوبر', 'نومبر', 'دسمبر']
    day_names = ['', 'سوموار', 'منگل', 'بدھ', 'جمعرات', 'جمعہ', 'ہفتہ', 'اتوار']
    day_abbreviations = ['', 'سوموار', 'منگل', 'بدھ', 'جمعرات', 'جمعہ', 'ہفتہ', 'اتوار']