import sys
from math import trunc
from typing import (
class TamilLocale(Locale):
    names = ['ta', 'ta-in', 'ta-lk']
    past = '{0} நேரத்திற்கு முன்பு'
    future = 'இல் {0}'
    timeframes = {'now': 'இப்போது', 'second': 'ஒரு இரண்டாவது', 'seconds': '{0} விநாடிகள்', 'minute': 'ஒரு நிமிடம்', 'minutes': '{0} நிமிடங்கள்', 'hour': 'ஒரு மணி', 'hours': '{0} மணிநேரம்', 'day': 'ஒரு நாள்', 'days': '{0} நாட்கள்', 'week': 'ஒரு வாரம்', 'weeks': '{0} வாரங்கள்', 'month': 'ஒரு மாதம்', 'months': '{0} மாதங்கள்', 'year': 'ஒரு ஆண்டு', 'years': '{0} ஆண்டுகள்'}
    month_names = ['', 'சித்திரை', 'வைகாசி', 'ஆனி', 'ஆடி', 'ஆவணி', 'புரட்டாசி', 'ஐப்பசி', 'கார்த்திகை', 'மார்கழி', 'தை', 'மாசி', 'பங்குனி']
    month_abbreviations = ['', 'ஜன', 'பிப்', 'மார்', 'ஏப்', 'மே', 'ஜூன்', 'ஜூலை', 'ஆக', 'செப்', 'அக்', 'நவ', 'டிச']
    day_names = ['', 'திங்கட்கிழமை', 'செவ்வாய்க்கிழமை', 'புதன்கிழமை', 'வியாழக்கிழமை', 'வெள்ளிக்கிழமை', 'சனிக்கிழமை', 'ஞாயிற்றுக்கிழமை']
    day_abbreviations = ['', 'திங்கட்', 'செவ்வாய்', 'புதன்', 'வியாழன்', 'வெள்ளி', 'சனி', 'ஞாயிறு']

    def _ordinal_number(self, n: int) -> str:
        if n == 1:
            return f'{n}வது'
        elif n >= 0:
            return f'{n}ஆம்'
        else:
            return ''